Revit 2026 API

# HardwoodFinishType Enumeration

---

The enumerated type representing the permitted values for the asset property "HardwoodFinish" from the "Hardwood" schema.

**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public enum HardwoodFinishType
```
```vb
Public Enumeration HardwoodFinishType
```
```cpp
public enum class HardwoodFinishType
```
```fsharp
type HardwoodFinishType
```

| Member name | Value | Description |
| --- | --- | --- |
| Gloss | 0 |  |
| Satin | 2 |  |
| Semigloss | 1 |  |
| Unfinished | 3 |  |

#### Reference

Autodesk.Revit.DB.Visual Namespace